#lang racket

; приказки
; бобо

(define (1+ n) (+ 1 n))
;square
; защо има въпросителни накрая? ???

(define (ascii->code char) 'покажи)

; факториел
; фибоначи



; задачки (`'тук` трябва да попълните):

; зад 1
; № | Преведете следните аритметични изрази на scheme: | пресмятат се до:
;---|--------------------------------------------------|-------------------
; 1 | (10 + 5.16 + 19 + 9.712361) * (20 - (16 - 4))    | 350.97888
; 2 | 1/4 + 2/5 + 3/8 + 6 * (5.1 - 1.6) * (9/3 - 7/4)  | 27.274999999999995
; 3 | 3^(60 ÷ 7) + ((2^10) ÷ 179)                      | 6566
; 4 | (1 - i)^21                                       | колко е?

(define calc1
  'тук)
(define calc2
  'тук)
(define calc3
  'тук)
(define calc4
  'тук)

; зад 2
(define (odd? n) ; четно
  'тук)
(define (even? n) ; нечетно
  'тук)

; зад 3
; схемата за оценяване
(define (grade points)
  'тук)
; бонус точка ако направите оценката да е наредена двойка от число и думичка

; зад 4
; сбор на целите числа в интервала [a, b]
(define (suminterval a b)
  'тук)

; зад 5
(define (slowpow x n) (* x (slowpow x (- n 1))))
; направете по-бърза имплементация от горната
(define (fastpow x n)
  'тук)

; уверете се че и двете функции връщат еднакви отговори
;(slowpow 2 10)
;(fastpow 2 10)

; сравнете и времената
;(time (begin (slowpow 57 100000) (void)))
;(time (begin (fastpow 57 100000) (void)))

; псст - Exponentiation by squaring

; зад 6
; синус по формулата на Тейлър около нулата, парциална сума до член n, тъжни спомени
(define (partial-sin x n)
  'тук)

; зад 7 сложна
; колко пъти цифрата d се среща в цялото число n?
(define (digit-occurence d n)
  'тук)
